var list = [{
  code: "fsw", //项目代码
  id: "fsw-000001", //项目id
  name: "加拿大联邦技术移民", //项目名称
  desc: "加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介", //项目简介
  details: "项目详情", //项目详情
  country: "加拿大", //国家
  countryId: "jnd22222", //国家代码
  type: "技术移民", //类别
  typeId: "jsym1111", //类别
  timespan: 3, //处理周期
  timespanUnit: "年", //处理周期 单位
  cost: 333, //费用
  costUnit: "万元", //费用单位
}, {
  code: "fsw", //项目代码
  id: "fsw-000001", //项目id
  name: "加拿大联邦技术移民", //项目名称
  desc: "加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介", //项目简介
  details: "项目详情", //项目详情
  country: "加拿大", //国家
  countryId: "jnd22222", //国家代码
  type: "技术移民", //类别
  typeId: "jsym1111", //类别
  timespan: 3, //处理周期
  timespanUnit: "年", //处理周期 单位
  cost: 333, //费用
  costUnit: "万元", //费用单位
}, {
  code: "fsw", //项目代码
  id: "fsw-000001", //项目id
  name: "加拿大联邦技术移民", //项目名称
  desc: "加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介", //项目简介
  details: "项目详情", //项目详情
  country: "加拿大", //国家
  countryId: "jnd22222", //国家代码
  type: "技术移民", //类别
  typeId: "jsym1111", //类别
  timespan: 3, //处理周期
  timespanUnit: "年", //处理周期 单位
  cost: 333, //费用
  costUnit: "万元", //费用单位
}, {
  code: "fsw", //项目代码
  id: "fsw-000001", //项目id
  name: "加拿大联邦技术移民", //项目名称
  desc: "加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简" +
    "介加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介", //项目简介
  details: "项目详情", //项目详情
  country: "加拿大", //国家
  countryId: "jnd22222", //国家代码
  type: "技术移民", //类别
  typeId: "jsym1111", //类别
  timespan: 3, //处理周期
  timespanUnit: "年", //处理周期 单位
  cost: 333, //费用
  costUnit: "万元", //费用单位
}, {
  code: "fsw", //项目代码
  id: "fsw-000001", //项目id
  name: "加拿大联邦技术移民", //项目名称
  desc: "加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介", //项目简介
  details: "项目详情", //项目详情
  country: "加拿大", //国家
  countryId: "jnd22222", //国家代码
  type: "技术移民", //类别
  typeId: "jsym1111", //类别
  timespan: 3, //处理周期
  timespanUnit: "年", //处理周期 单位
  cost: 333, //费用
  costUnit: "万元", //费用单位
}, {
  code: "fsw", //项目代码
  id: "fsw-000001", //项目id
  name: "加拿大联邦技术移民", //项目名称
  desc: "加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介", //项目简介
  details: "项目详情", //项目详情
  country: "加拿大", //国家
  countryId: "jnd22222", //国家代码
  type: "技术移民", //类别
  typeId: "jsym1111", //类别
  timespan: 3, //处理周期
  timespanUnit: "年", //处理周期 单位
  cost: 333, //费用
  costUnit: "万元", //费用单位
}, {
  code: "fsw", //项目代码
  id: "fsw-000001", //项目id
  name: "加拿大联邦技术移民", //项目名称
  desc: "加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介，加拿大联邦技术移民项目简介", //项目简介
  details: "项目详情", //项目详情
  country: "加拿大", //国家
  countryId: "jnd22222", //国家代码
  type: "技术移民", //类别
  typeId: "jsym1111", //类别
  timespan: 3, //处理周期
  timespanUnit: "年", //处理周期 单位
  cost: 333, //费用
  costUnit: "万元", //费用单位
}]

_app = new Vue({
  "el": '.list-c',
  "data": {
    "list": list
  }
})
