var list = [{
  title: "问题1",
  question: "个人状况",
  details: [{
    subtitle: "",
    q: ["您是否拥有希望共同移民的配偶或未婚伴侣？（以下简称伴侣）"],
    a: [
      ["有", "无"]
    ]
  }]
}, {
  title: "问题2",
  question: "年龄",
  details: [{
    subtitle: "",
    q: ["请选择您及您伴侣（如有）的年龄 ？"],
    a: [
      ["20 - 29岁", "30 - 39岁", "40 - 49岁", "50 - 59岁"]
    ]
  }]
}, {
  title: "问题3",
  question: "子女情况",
  details: [{
    subtitle: "",
    q: ["12岁以下子女数量"],
    a: [
      [
        0,
        1,
        2,
        3,
        4,
        5
      ]
    ]
  }, {
    subtitle: "",
    q: ["13到21岁子女数量"],
    a: [
      [
        0,
        1,
        2,
        3,
        4,
        5
      ]
    ]
  }]
}, {
  title: "问题4",
  question: "学历状况",
  details: [{
    subtitle: "",
    q: ["请选择您及您伴侣（如有）的最高学历"],
    a: [
      [
        "博士",
        "硕士",
        "本科(4 年制）",
        "本科(3 年制）",
        "本科(2 年制）",
        "本科(1 年制）",
        "专科(文科）",
        "专科(理科）",
        "普通高中",
        "职业高中"
      ]
    ]
  }]
}, {
  title: "问题5",
  question: "外语水平",
  details: [{
    subtitle: "5.1 请预估您及您伴侣(如有)的英语雅思水平",
    q: [
      "● 听", "● 说", "● 读", "● 写"
    ],
    a: [
      [
        0,
        0.5,
        1,
        1.5,
        2,
        2.5,
        3,
        3.5,
        4,
        4.5,
        5,
        5.5,
        6,
        6.5,
        7,
        7.5,
        8,
        8.5,
        9
      ],
      [
        0,
        0.5,
        1,
        1.5,
        2,
        2.5,
        3,
        3.5,
        4,
        4.5,
        5,
        5.5,
        6,
        6.5,
        7,
        7.5,
        8,
        8.5,
        9
      ],
      [
        0,
        0.5,
        1,
        1.5,
        2,
        2.5,
        3,
        3.5,
        4,
        4.5,
        5,
        5.5,
        6,
        6.5,
        7,
        7.5,
        8,
        8.5,
        9
      ],
      [
        0,
        0.5,
        1,
        1.5,
        2,
        2.5,
        3,
        3.5,
        4,
        4.5,
        5,
        5.5,
        6,
        6.5,
        7,
        7.5,
        8,
        8.5,
        9
      ]
    ]
  }, {
    subtitle: "5.2 请预估您及您伴侣(如有)的法语水平",
    q: [
      "● 听", "● 说", "● 读", "● 写"
    ],
    a: [
      [
        "高", "中", "低", "入门", "不会"
      ],
      [
        "高", "中", "低", "入门", "不会"
      ],
      [
        "高", "中", "低", "入门", "不会"
      ],
      [
        "高", "中", "低", "入门", "不会"
      ]
    ]
  }]
}, {
  title: "问题6",
  question: "工作经历",
  details: [{
    subtitle: "",
    q: ["请选择您及您伴侣（如有）过去十年所从事过的工作职业（可多选）"],
    a: [
      [
        "制造业工程师、 经理类",
        "维修 / 操作技师、 技工类",
        "农业、 园艺类",
        "企业咨询类",
        "土地测量类",
        "医疗、 生物类",
        "幼教类",
        "地质矿产类",
        "计算机类",
        "社会及社区工作",
        "土木、 建筑类",
        "大专及职业院校教师",
        "法律相关",
        "广告市场",
        "行政助理",
        "护士",
        "金融财会类",
        "其他"
      ]
    ]
  }]
}, {
  title: "问题7",
  question: "工作年限",
  details: [{
    subtitle: "",
    q: ["请将过去十年内您及您配偶(如有） 所从事过的工作,通过拖拽按时间先后大致排序；并标注每类工作时间长短。"],
    a: [
      ["** ** ** *"]
    ]
  }]
}]

_app = new Vue({
  "el": '.main',
  "data": {
    "list": list
  }
})
